app/controllers/comments_controller.rb

INSERT INTO `comments` (`content`, `user_id`, `micropost_id`, `created_at`, `updated_at`) VALUES ('lala', 101, 303, '2018-06-27 13:43:02', '2018-06-27 13:43:02')
---
  def create
    @comment = Comment.new(comment_params)
    respond_to do |format|
      if @comment.save

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 1 LIMIT 1
DELETE FROM `comments` WHERE `comments`.`id` = 1
---
  def destroy
  	@comment = Comment.find(params[:id])
  	micropost = @comment.micropost
    @comment.destroy