app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO `microposts` (`content`, `user_id`, `created_at`, `updated_at`, `picture`, `title`) VALUES ('ahihi', 101, '2018-06-27 11:55:49', '2018-06-27 11:55:49', 'foody-mobile-mokchang-jpg-171-636159265399014538.jpg', 'haha')

  def destroy
    @micropost.destroy
---
DELETE FROM `microposts` WHERE `microposts`.`id` = 301

  def show
    @micropost = Micropost.find(params[:id])
    @comments = @micropost.comments.all
---
SELECT  `microposts`.* FROM `microposts` WHERE `microposts`.`id` = 1 ORDER BY `microposts`.`created_at` DESC LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`micropost_id` = 303